/*
  ******************************************************************************
  * @file           : app_cfg.h
  * @brief          : 应用程序配置接口
  ******************************************************************************
  * @attention
  *
  * 
  *
  ******************************************************************************
  */

#ifndef __APP_CFG_H
#define __APP_CFG_H

/* ---------------------------使用STM32 HAL库------------------------- */
#include "main.h"

/* -------------------------------标准库------------------------------ */
#include  <stdarg.h>
#include  <stdio.h>
#include  <stdlib.h>
#include  <math.h>

/* -------------------------------其他库------------------------------ */
//#include  <cpu.h>
#include  <lib_def.h>
#include  <lib_ascii.h>
#include  <lib_math.h>
#include  <lib_mem.h>
#include  <lib_str.h>

/* -------------------------------操作系统---------------------------- */
#include  <os.h>

/* --------------------------------用户库=---------------------------- */
#include "system.h"

/* -------------------------------功能开关---------------------------- */
#define APP_CFG_DBG_TMR                     0                   //调试用软件定时器，确定系统是否正常运行
#define APP_CFG_DBG_LCD                     1                   //通过LCD屏幕输出调试信息

/* -----------------------------任务堆栈尺寸-------------------------- */
#define APP_CFG_TASK_START_STK_SIZE         512u
#define APP_CFG_TASK_ETH_STK_SIZE         512u



/* ------------------------------任务优先级--------------------------- */
#define APP_CFG_TASK_START_PRIO             ((OS_PRIO)(OS_CFG_PRIO_MAX-4u))
#define APP_CFG_TASK_ETH_PRIO               2

#endif  /* __APP_CFG_H */
