/*
 ******************************************************************************
 * @file           : app_lcd.c
 * @brief          : lcd显示屏应用实现
 ******************************************************************************
 * @attention
 *
 * 
 *
 ******************************************************************************
 */

#include "app_lcd.h"

/* -------------------------------局部变量---------------------------- */
static OS_MUTEX App_LCDMutex;

/*
*********************************************************************************************************
*	函    数: App_LCDResourceInit
*	说    明: 初始化LCD显示所需要的的系统资源
*	形    参: 无
*	返    回: 无
*********************************************************************************************************
*/
OS_ERR App_LCDObjectInit(void)
{
  OS_ERR err;
  OSMutexCreate(&App_LCDMutex, "LCDMutex", &err);
  return err;
}

/*
*********************************************************************************************************
*	函    数: App_LCDPend
*	说    明: 给LCD硬件上互斥锁
*	形    参: timeout       上锁时长，0代表永久等待解锁
*
*	返    回: 错误信息
*********************************************************************************************************
*/
OS_ERR App_LCDPend(OS_TICK timeout)
{
  OS_ERR err;

  OSMutexPend(&App_LCDMutex,
              timeout,
              OS_OPT_PEND_BLOCKING,
              (CPU_TS *)NULL,
              &err);
  return err;
}

/*
*********************************************************************************************************
*	函    数: App_LCDPost
*	说    明: 给LCD硬件解互斥锁
*	形    参: 无
*	返    回: 错误信息
*********************************************************************************************************
*/
OS_ERR App_LCDPost(void)
{
  OS_ERR err;

  OSMutexPost(&App_LCDMutex,
              OS_OPT_POST_NONE,
              &err);
  return err;
}

